{"format":"layers-model","generatedBy":"keras v3.10.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.10.0","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential","trainable":true,"dtype":"float32","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"}},{"class_name":"Conv2D","config":{"name":"conv2d","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Activation","config":{"name":"activation","trainable":true,"dtype":"float32","activation":"relu"}},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"}},{"class_name":"Conv2D","config":{"name":"conv2d_1","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_1","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Activation","config":{"name":"activation_1","trainable":true,"dtype":"float32","activation":"relu"}},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d_1","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last"}},{"class_name":"Conv2D","config":{"name":"conv2d_2","trainable":true,"dtype":"float32","filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_2","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Activation","config":{"name":"activation_2","trainable":true,"dtype":"float32","activation":"relu"}},{"class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d","trainable":true,"dtype":"float32","data_format":"channels_last","keepdims":false}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":62,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}],"build_input_shape":[null,28,28,1]}},"training_config":{"loss":"categorical_crossentropy","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.0002500000118743628,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-7,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"sequential/batch_normalization/gamma","shape":[32],"dtype":"float32"},{"name":"sequential/batch_normalization/beta","shape":[32],"dtype":"float32"},{"name":"sequential/batch_normalization/moving_mean","shape":[32],"dtype":"float32"},{"name":"sequential/batch_normalization/moving_variance","shape":[32],"dtype":"float32"},{"name":"sequential/batch_normalization_1/gamma","shape":[64],"dtype":"float32"},{"name":"sequential/batch_normalization_1/beta","shape":[64],"dtype":"float32"},{"name":"sequential/batch_normalization_1/moving_mean","shape":[64],"dtype":"float32"},{"name":"sequential/batch_normalization_1/moving_variance","shape":[64],"dtype":"float32"},{"name":"sequential/batch_normalization_2/gamma","shape":[128],"dtype":"float32"},{"name":"sequential/batch_normalization_2/beta","shape":[128],"dtype":"float32"},{"name":"sequential/batch_normalization_2/moving_mean","shape":[128],"dtype":"float32"},{"name":"sequential/batch_normalization_2/moving_variance","shape":[128],"dtype":"float32"},{"name":"sequential/conv2d/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"sequential/conv2d/bias","shape":[32],"dtype":"float32"},{"name":"sequential/conv2d_1/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"sequential/conv2d_1/bias","shape":[64],"dtype":"float32"},{"name":"sequential/conv2d_2/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"sequential/conv2d_2/bias","shape":[128],"dtype":"float32"},{"name":"sequential/dense/kernel","shape":[128,128],"dtype":"float32"},{"name":"sequential/dense/bias","shape":[128],"dtype":"float32"},{"name":"sequential/dense_1/kernel","shape":[128,62],"dtype":"float32"},{"name":"sequential/dense_1/bias","shape":[62],"dtype":"float32"}]}]}